OpenPuya/PY32L020_Firmware/Drivers/PY32L020_HAL_Driver/Inc/py32l020_ll_comp.h
/** @defgroup COMP_LL_EC_COMMON_WINDOWMODE Comparator common modes - Window mode
  * @{
  */
#define LL_COMP_WINDOWMODE_DISABLE                 (0x00000000U)                                                    /*!< Window mode disable: Comparators 1 and 2 are independent */
#define LL_COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | LL_COMP_WINDOWMODE_COMP_ODD_REGOFFSET_MASK)  /*!< Window mode enable: if used from COMP1 or COMP2 instance, comparators instances pair COMP1 and COMP2 have their input plus connected together, the common input is COMP2 input plus (COMP1 input plus is no more accessible). */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_PLUS Comparator inputs - Input plus (input non-inverting) selection
  * @{
  */
#define LL_COMP_INPUT_PLUS_IO1          (0x00000000U)     /*!< Comparator input plus connected to IO1 (Reserved for COMP1, pin PA3 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO2          (COMP_CSR_INPSEL) /*!< Comparator input plus connected to IO2 (Reserved for COMP1, VREFCMP for COMP2) */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_MINUS Comparator inputs - Input minus (input inverting) selection
  * @{
  */
#define LL_COMP_INPUT_MINUS_IO1         (0x00000000U)     /*!< Comparator input minus connected to IO1 (pin PB0 for COMP1, pin PA4 for COMP2) */
#define LL_COMP_INPUT_MINUS_IO2         (COMP_CSR_INNSEL) /*!< Comparator input minus connected to IO2 (pin PB1 for COMP1, pin PA3 for COMP2) */
/**
  * @}
  */
  
/** @defgroup COMP_LL_EC_VREFCMP_DIV Comparator Vrefcmp div
  * @{
  */
#define LL_COMP_VREFCMP_DIV_1_16VREFCMP     (0x00000000U)     
#define LL_COMP_VREFCMP_DIV_2_16VREFCMP     (                                                                        COMP_CSR_COMP_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_3_16VREFCMP     (                                                COMP_CSR_COMP_VCDIV_1                        ) 
#define LL_COMP_VREFCMP_DIV_4_16VREFCMP     (                                                COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_5_16VREFCMP     (                        COMP_CSR_COMP_VCDIV_2                                                ) 
#define LL_COMP_VREFCMP_DIV_6_16VREFCMP     (                        COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_7_16VREFCMP     (                        COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        ) 
#define LL_COMP_VREFCMP_DIV_8_16VREFCMP     (                        COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_9_16VREFCMP     (COMP_CSR_COMP_VCDIV_3                                                                        )  
#define LL_COMP_VREFCMP_DIV_10_16VREFCMP    (COMP_CSR_COMP_VCDIV_3                                                 | COMP_CSR_COMP_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_11_16VREFCMP    (COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1                        )  
#define LL_COMP_VREFCMP_DIV_12_16VREFCMP    (COMP_CSR_COMP_VCDIV_3                         | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_13_16VREFCMP    (COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                                                ) 
#define LL_COMP_VREFCMP_DIV_14_16VREFCMP    (COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2                         | COMP_CSR_COMP_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_15_16VREFCMP    (COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1                        ) 
#define LL_COMP_VREFCMP_DIV_VREFCMP         (COMP_CSR_COMP_VCDIV_3 | COMP_CSR_COMP_VCDIV_2 | COMP_CSR_COMP_VCDIV_1 | COMP_CSR_COMP_VCDIV_0) 
/**
  * @}
  */  
 
/** @defgroup COMP_LL_EC_VREFCMP_SRC Comparator Vrefcmp source
  * @{
  */
#define LL_COMP_VREFCMP_SOURCE_VREFBUF       (0x00000000U)
#define LL_COMP_VREFCMP_SOURCE_VCC           (COMP_CSR_COMP_VCSEL)

/**
  * @}
  */

/** @defgroup COMP_LL_EC_VREFCMP_SRC_VREFBUF_VOLTAGE Comparator Vrefbuf voltage source
  * @{
  */
/* Note: If the internal reference voltage is selected for the comparator reference source   */
/*       voltage, it is recommended to use LL_COMP_VREFCMP_SOURCE_VREFBUF1P5V, which is more */
/*       accurate than other values.                                                         */

#define LL_COMP_VREFCMP_SOURCE_VREFBUF1P5V   LL_COMP_VREFCMP_SOURCE_VREFBUF
#define LL_COMP_VREFCMP_SOURCE_VREFBUF2P048V ADC_CR_VREFBUFF_SEL_0
#define LL_COMP_VREFCMP_SOURCE_VREFBUF2P5V   ADC_CR_VREFBUFF_SEL_1

/**
  * @}
  */   

/** @defgroup COMP_LL_EC_OUTPUT_POLARITY Comparator output - Output polarity
  * @{
  */
#define LL_COMP_OUTPUTPOL_NONINVERTED   (0x00000000U)           /*!< COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input */
#define LL_COMP_OUTPUTPOL_INVERTED      (COMP_CSR_POLARITY)     /*!< COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_LEVEL Comparator output - Output level
  * @{
  */
#define LL_COMP_OUTPUT_LEVEL_LOW        (0x00000000U)          /*!< Comparator output level low (if the polarity is not inverted, otherwise to be complemented) */
#define LL_COMP_OUTPUT_LEVEL_HIGH       (0x00000001U)          /*!< Comparator output level high (if the polarity is not inverted, otherwise to be complemented) */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_HW_DELAYS  Definitions of COMP hardware constraints delays
  * @note   Only COMP peripheral HW delays are defined in COMP LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

